brew "awscli"
brew "codex"
brew "direnv"
brew "fnm"
brew "fzf"
brew "gcc"
brew "gh"
brew "gibo"
brew "git-lfs"
brew "gomplate"
brew "huggingface-cli"
brew "jq"
brew "micromamba"
brew "node"
brew "pnpm"
brew "pueue"
brew "rustup"
brew "uv"
brew "yarn"
brew "zsh-completions"
