cask_args appdir: "/Applications"
tap "homebrew/autoupdate"
tap "homebrew/cask"
tap "aws/tap"
tap "cloudquery/tap"
tap "graalvm/tap"
tap "heroku/brew"
tap "johanhaleby/kubetail"
tap "xhiroga/aws-session-manager-plugin"
tap "xhiroga/tap"
tap "mongodb/brew"
tap "TylerBrock/saw"
tap "weaveworks/tap"

brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"

brew "asciinema"
brew "ansible"
brew "anyenv"
brew "aws-cdk"
brew "awscli"
brew "aws-session-manager-plugin"
brew "bash"
brew "bash-completion"
brew "bfg"
brew "cabocha"
brew "chamber"
brew "cmake"
brew "deno"
brew "docker-compose"
brew "exa"
brew "ffmpeg"
brew "fnm"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "gitleaks"
brew "git-lfs"
brew "go"
brew "gomplate"
brew "graphviz"
brew "gnupg"
brew "hadolint"
brew "hdf5" # tensorflow dependency
brew "helm"
brew "helmfile"  # helm plugin install https://github.com/databus23/helm-diff needed
brew "jq"
brew "kubetail"
brew "lazydocker"
brew "mecab"
brew "mecab-ipadic"
brew "mongodb-community"
brew "mongodb-database-tools"
brew "node"
brew "openblas"
brew "openssl"  # tensorflow dependency
brew "peco"
brew "pipenv"
brew "pnpm"
brew "podman"
brew "poetry"
brew "pre-commit"
# Linux ps command can not be imported to OSX, https://apple.stackexchange.com/questions/187783/can-i-use-gnu-ps-on-os-x
brew "psgrep"
brew "pstree"
brew "python3"  # for AWS tools and VSCode
brew "redis"
brew "rbenv"
brew "ruby"
brew "ruby-build"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "wget"
brew "xz"
brew "yarn"
brew "zlib" # tensorflow dependency
brew "zsh-syntax-highlighting"

cask "1password-cli"
cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alfred"
cask "brave-browser"
cask "chromedriver"
cask "cocoapods"
cask "dash"
# cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "docker"
cask "firefox"
cask "fork"
cask "gitify"
cask "github"
cask "grammarly"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
# cask "google-japanese-ime"    # When using, "Cannot start conversaion engine." error occurs.
cask "imageoptim"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kindle"
cask "little-snitch"
cask "micro-snitch"
cask "multipass"
cask "nordvpn"
cask "obs"
cask "obsidian"
cask "onedrive"
cask "podman-desktop"
cask "postman"
cask "rectangle"
cask "robo-3t"
cask "vagrant"
cask "wireshark"
cask "xquartz"
cask "zotero"
