cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "aws/tap"
tap "cloudquery/tap"
tap "graalvm/tap"
tap "heroku/brew"
tap "johanhaleby/kubetail"
tap "xhiroga/aws-session-manager-plugin"
tap "xhiroga/tap"
tap "mongodb/brew"
tap "TylerBrock/saw"
tap "weaveworks/tap"

brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"

brew "arp-scan"
brew "ansible"
brew "anyenv"
brew "aws-cdk"
brew "awscli"
brew "aws-session-manager-plugin"
brew "bash"
brew "bash-completion"
brew "bfg"
brew "cabocha"
brew "chamber"
brew "cmake"
brew "deno"
brew "dep"
brew "exa"
brew "firefox"
brew "ffmpeg"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-lfs"
brew "git-secrets"
brew "go"
brew "gomplate"
brew "gradle"
brew "graphviz"
brew "gnupg"
brew "hadolint"
brew "helm"
brew "helmfile"  # helm plugin install https://github.com/databus23/helm-diff needed
brew "heroku"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "kubetail"
brew "lazydocker"
brew "mas"
brew "maven"
brew "mecab"
brew "mecab-ipadic"
brew "minikube"
brew "mongodb-community"
brew "mongodb-database-tools"
brew "node"
brew "openblas"
brew "peco"
brew "pipenv"
brew "pnpm"
brew "poetry"
brew "postgresql"
# Linux ps command can not be imported to OSX, https://apple.stackexchange.com/questions/187783/can-i-use-gnu-ps-on-os-x
brew "psgrep"
brew "pstree"
brew "python3"  # for AWS tools and VSCode
brew "redis"
brew "ruby"
brew "ruby-build"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tree"
brew "watchman" # for React Native
brew "weaveworks/tap/eksctl"
brew "wget"
brew "xz"
brew "yarn"
brew "yq"
brew "zsh-syntax-highlighting"

cask "1password-cli"
cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "alfred"
cask "aws-vault"
cask "brave-browser"
cask "chromedriver"
cask "cocoapods"
cask "dash"
# cask "dbeaver-community"
cask "deepl"
cask "discord"
cask "docker"
cask "fork"
cask "gitify"
cask "github"
cask "grammarly"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "imageoptim"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "kindle"
cask "little-snitch"
cask "micro-snitch"
cask "multipass"
cask "ngrok"
cask "nordvpn"
cask "obs"
cask "obsidian"
cask "onedrive"
cask "postman"
cask "rectangle"
cask "robo-3t"
cask "slack"
cask "vagrant"
cask "wireshark"
cask "xquartz"
cask "zoom"

mas "Cyberduck", id: 409222199
mas "Hex Fiend", id: 1342896380
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Microsoft Remote Desktop 4+", id: 1295203466
mas "The Unarchiver", id: 425424353
mas "Transporter", id: 1450874784
mas "Xcode", id: 497799835
